Autodesk.Revit.DB.Architecture.TopographySurface.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Collections.Generic.IList{System.Int32}},System.String)
Creates a new topography surface element from facets and adds it to the document.
Remarks:
The document will be regenerated during the creation of this topography surface element.
The topography surface created by facet cannot modify its triangle points and facets.
document:
The document to be modified.
points:
A collection of points.
The points represent an enclosed area in the XY plane.
facets:
Triangle faces composing a polygon mesh.
Every facet contains 3 integer representing vertex indices.
name:
The name for the topography surface.
Returns:
The new topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
-or-
There were not enough points to form a valid region (at least 3 are required), or the points were collinear ignoring elevation.
-or-
There are invalid face in the input face set.
-or-
name cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019

Autodesk.Revit.DB.Architecture.TopographySurface.ChangePointElevation(Autodesk.Revit.DB.XYZ,System.Double)
Changes the elevation value for a point.
Remarks:
If the point doesn's exist in the current TopographySurface, an exception will be thrown.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
point:
The point to be modified.
elevationValue:
The new elevation value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point does not exist in the current topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for elevationValue must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The points of this topography surface are not editable.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.
Since:
2014